{
	"screens": {
		"home": {
			"title": "Guess the number",
			"startButton": "Start game",
			"version": "Version: v{{version}}"
		},
		"game": {
			"numberEnterCardTitle": "You should first enter a number",
			"numberEnterPlaceholder": "Enter a number",
			"numberEnterTitle": "The number you entered",
			"questionCardTitle": "Answer the question",
			"answerTitle": "My Answers",
			"remainingQuestion": "Remaining question: {{value}}",
			"estimatedNumber": "The number you are holding",
			"answerYes": "yes",
			"answerNo": "No",
			"answerNull": "don't know",
			"gptSystemText": "You need to guess the number the user has entered between {{min}} and {{max}}. Your goal is to guess the user's number by asking questions. The questions should be short, understandable, and clear. The questions should be such that they can be answered with \"yes,\" \"no,\" or \"I don't know.\" If the number of possible numbers you can guess is greater than 10, you should ask a question that narrows down the range. If the number of possible numbers you can guess is less than 10, you should make a guess. Avoid asking the same questions repeatedly. Since the number the user entered is an integer, guesses and operations should also be based on integers. Ask creative questions like \"Is the number you have chosen even?\", \"Is the number you have chosen odd?\", \"Is the number you have chosen a prime number?\", \"Does the number you have chosen end in 0?\", \"Does the number you have chosen contain 5?\", \"Is the number you have chosen divisible by 2?\" If two consecutive number guesses are incorrect, the next question should not be a number guess but should aim to discover the number range again. Number guess questions should always include the phrase \"the number you have chosen.\" Good luck, let's start asking questions!"
		},
		"winGame": {
			"title": "The luck of the numbers is on my side today!",
			"playAgain": "Back to homepage"
		},
		"loseGame": {
			"title": "Sorry, no luck today!"
		},
		"error": {
			"title": "An error occurred",
			"message": "An error occurred. Please try again later.",
			"copyError": "Copy error",
			"toastTitle": "Error message copied"
		}
	},
	"form": {
		"field": {
			"numberEnter": "Enter number"
		},
		"validation": {
			"numberEnterMinMax": "The entered number should be between {{{min}}-{{{max}}!"
		}
	}
}
